Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 让她错愕的是，只有铸鼎境二重的江逸竟依旧轻松能躲避开去，这次她还是没有碰触到江逸的半片衣角。
en_us: What left her astonished was that Jiang Yi, whose power level was only at the second stage of the Cast Tripod Realm, could actually once again easily avoid her attack. This time she once again failed to touch even the corner of Jiang Yi's robes.

source: 让江逸惊愕的是，他元力刚刚注入丹炉内，那丹炉竟如一块吸水的海绵般，快速的自动吸收他的元力，而且吸收的速度快得吓人，他双手经脉内的元力一下就全被吸收完了。
en_us: What befuddled Jiang Yi was that the essence force, which he had just been applied to the cauldron, was being absorbed speedily and automatically by the cauldron like a sponge—with the absorption at a shocking speed, so fast that the essence force in the meridians in his hands was completely absorbed in an instant.

source: 让江逸诧异的是，那身材火辣的翊小姐进来后没有立即出手，反而朝他感激的一笑，抱拳行礼道：“你叫苍狼？多谢你的陪练！希望你今日同样全力以赴。”
en_us: What astonished Jiang Yi was that, Young Mistress Yi, who had a hot figure, did not immediately launch an attack upon entry, but rather smiled at him with a look of gratitude. She cupped her fists and bowed, saying, "Is your name 'Lone Wolf'? Thank you very much for your combat practice with me the other time! I hope that, like before, you will give it your all today."

source: 讪讪的走出聚珍阁，江逸茫然的站在广场上，看着车水马龙川流不息，内心苦恼不已。有了灵神丹，他倒是不惧江如虎等人了，问题是炼丹房都被封了，他也没废丹，怎么快速赚钱啊？
en_us: Embarrassed, Jiang Yi walked out of the Pearl Gathering Pavilion and blankly stood at the City Plaza. As he observed the unending flow of heavy traffic, his heart felt endlessly distressed. With the Spirit Pills, he was actually not fearful of Jiang Ruhu and his cronies. The problem was in that situation that with the sealing-up of the alchemy lab, and without any more useless elixirs, how could he rapidly make lots of money?

source: 试问一个百分百能继承王爷爵位的世子殿下，知道自己还有一个同父异母的私生子弟弟，会不会千方百计的弄死他？确保他的继承资格？
en_us: To a prince who already has his stake on the throne, would he kill his stepbrother once he finds out of his very existence? Just to ensure his claim on the throne?

source: 话一出口，江逸就有些后悔了，他忘记了一件事，江恨水好像就在武殿里面？万一和江恨水对上了，他身份不得立即曝光？江家子弟在武殿内当陪练，这可不是光彩的事情……
en_us: As the words left his mouth, Jiang Yi instantly felt some regret. He forgot one thing: wasn't Jiang Henshui in the Martial Arts Hall? If he was paired up with Jiang Henshui, wouldn't his identity immediately be revealed? That a descendant of the Jiang Clan was serving as a sparring partner in the Martial Arts Hall... this was not something honorable at all...

source: 话落，刚还有些畏畏缩缩的思羽，突然猛的抬起了头，瞬间似是有了无限勇气一般，用力的点头道，“是！掌门！”
en_us: Right after Shen Ying finished, Si Yu, who was previously very timid, suddenly held her head up high, and with somewhat infinite amount of bravery, she nodded her head confidently and said, "Yes! Sect Master!"

source: 话落，手中的剑往前用力一扫，顿时一道长长的白光瞬间发出，向着兽潮方向急驰而去，仿佛瞬间把天地一分为二般。只听见哗啦啦的一阵开裂声，刚刚还凶神恶煞的兽群，全数被拦腰截断，身体像下饺子一样唰唰的掉进了海里，掀起一道道巨浪，染红了整个海面。
en_us: With that, she thrust the sword out and a long beam of light shot out at great speed towards the Beast Tide. Earth and sky seemed to be hacked into two by her sword. Then came an ear splitting cracking sound. The entire army of ferocious spirit beasts were collectively severed at their waists. Their torsos fell into the sea like dumplings into a pot, creating huge waves that dyed the entire sea red.

source: 话落，毕浩手上一松，顿时一喜，“毕浩告退！”说完拉住一边满腹怨言的任翼，快步飞身而去，瞬间就没了踪影，仿佛背后有恶鬼追赶般。
en_us: At her words, Bi Hao's hands became relaxed, and he was immediately joyous. "I shall take my leave now!" He quickly dragged along Ren Yi who grumbled with indignance as they left and disappeared within a moment, as if being chased by evil ghosts.

source: 话还没落下，江逸的腿又高高抬起，对着江如虎的一条腿狠狠踩下……
en_us: Before he even finished his sentence, Jiang Yi lifted his leg high and stomped on Jiang Ruhu's leg.

source: 话还没说完，沈萤却一把抓住了孤月的衣领，扔下一句，“帮个忙。”再次消失在原地。
en_us: But before he could finish, Shen Ying grabbed Lonemoon by his collar and demanded, "Help me." She then disappeared from the same spot.

source: 话音一落，白色的灵光顿时扫向了整个门派。他周身灵气瞬间暴涨，彻底陷入顿悟之中。
en_us: As soon as Lonemoon finished speaking, a white aura suddenly swept through the entire sect. The Spirit Qi in his entire body surged up and he was completely immersed in his epiphany.

source: 话音刚落，一只蓝色的袋子顿时伸到了她眼前。
en_us: As soon as she finished speaking, a blue bag appeared before her eyes.

source: 诡异的是，这座浮峰飘在妖界上空，四周的妖气，似是有意避开了这座灵峰一样，只徘徊在灵峰几公里外的地界，没有半点侵入峰内的样子。像是生生在妖界之中，化出一块完全相反的地域一样。
en_us: The strange thing was that the surrounding demonic aura seemed to be deliberately avoiding this spiritual peak, only lingering at its peripheral boundaries a few kilometers away—the demon aura showed no signs of wanting to invade. It was as if a completely different territory had been carved out of the Demon Realm.

source: 语落那白光顿时组成了另外一行小字，写的是地点和时间。
en_us: After the voice stopped talking, the white light suddenly grouped into another line of small characters, detailing the time and venue.

source: 语落，他只觉得衣领顿时一紧，一股巨大的拉力直接拽着他摔到了地上，下一刻一个拳头，用力砸了下来。
en_us: Zhen Xiang suddenly felt his collar tightening as an tremendous force pulled him in and directly hurled him to the ground, and then came a punch pounding down on him.

source: 语落，众人齐齐开口。
en_us: All of them spoke at once:

source: 语落，幡旗里的哭声更加撕心裂肺了，连成线的水滴哗啦啦从旗内渗了出来。
en_us: At those words of hers, the sobbing from the gonfalon grew louder with anguish, and the droplets of water lined up and seeped out of the gonfalon.

source: 说到底，尼玛还是忘不了吃！
en_us: At the end of the day, you still can’t forget about eating!

source: 说到这个翊凌雪满脸兴奋起来，攥着小拳头笑着说道：“苍狼，不瞒你说这些其实是你的功劳，我天资怎么样我自己清楚，感悟武技速度很慢，要不是你……我这十多种武技怎么会那么快达到大成？今日我留下来其实是就是为了这事！”
en_us: Yi Lingxue grew excited at Jiang Yi's words and fisted her hands, smiling, "To be honest with you, Lone Wolf, all these achievements were because of you. I'm perfectly aware of the extent of my own abilities. Actually, the reason I'm staying behind today is precisely this!"

source: 说好信任呢？
en_us: Where's the trust as promised?

source: 说好的为他来捉灵兽的呢？都可以抱走沈萤了，为啥不顺手拉他一把？
en_us: They agreed to come here to look for spirit beasts for him. If his Spirit Master could hang on that tightly to Shen Ying, why coudn't he pull Yi Feng along as well?

source: 说好的人妖不两立呢？
en_us: What happened to humans and demons never coexisting?

source: 说好的剑仙呢？为啥会随身带着这么多糕点，你丫就是个厨子吧！
en_us: Where's the sword immortal? Why would you bring so many pastries, you are totally a chef!

source: 说完一挥手，带着十几个修士哗啦啦的又飞走了。
en_us: He waved his hand and, together with the cultivators he had brought along, flew into the sky.

source: 说完不再停留，直接就出了门。
en_us: She walked out of the door as soon as she finished speaking.

source: 说完他一挥手，一缕仙气就飞向地上只剩一口气的人，青岚的整个身体也缓缓的升了起来，“你虽仙骨已断，但你我既有如此缘分，我便先助你打通仙骨。”
en_us: He waved his hand. The Immortal Qi floated toward Qing Lan, who felt like he was breathing his last. Qing Lan's entire body began to float off the ground. "Your immortal bones are all broken. You and I have been brought together by fate. Let me heal your immortal bones first."

source: 说完他一脸兴奋拿起筷子，就要开吃。
en_us: On saying that, he happily took up the chopsticks and started eating.

source: 说完他直接唤出法器就冲了过来。这是威胁不成，打算强抢了。孤月冷笑一声，转手把草木灵收进储物袋，边唤出武器边低声道，“沈萤，等会中间那个就交给你了。”
en_us: As he finished, he whipped out his Dharma artifact and charged toward them. This was what it meant to resort to robbery after a failed threat. Lonemoon scoffed and slipped the Vegetation Spirit into his storage bag. He drew his weapon as he muttered under his breath, "Shen Ying, you take the one in the middle."

source: 说完他直接调动灵气，一手按在石板上，一时间石板上的纹路，像是被点亮一般，瞬间亮了起来，而且越来越大，直到扩散到整个碎石堆里，或大或小的碎石纷纷浮了起来，而脚下的石板，晃了晃开始慢慢往四周挪移开来。
en_us: After he finished activating his Spirit Qi, Lonemoon pressed his hands directly on the stone slate. As if being lit, the markings on the slate shone brightly, the lights spreading wider and wider until it covered the entire pile of gravel. Both big and small pieces of gravel floated up. The stone slate under his feet shook and then began to move apart slowly.

source: 说完他立马双手结印，扬手一挥，顿时四人面前就出现了人面水镜一样的东西，从水镱内往下看去。整个仙城的仙气消失了，城中隐隐流动着一条银色仙脉，半会仙脉也慢慢淡了下去，终于露出最里面的东西，那一片浓郁的黑色。
en_us: Once he finished saying, his two hands conjured up a seal and he waved his hands. Instantly, a water mirror like thing appeared in front of the four people. Looking down from the face of the water mirror, the entire city's immortal Qi vanished. There was still a bit of silver immortal pulse left flowing inside the city, but after a while, it faded away as well, finally revealing what was hidden beneath. It was a thick, dark shadow of black.

source: 说完他身影一闪，瞬间出现在了沈萤面前，扬手朝着她额头一点，打算强行传承。
en_us: Once the words were out of his mouth, his form flickered. Suddenly, he appeared in front of Shen Ying. He reached for her forehead, seeking to pass down his heritage by force.

source: 说完哼了一声，转头看向仍瘫在地上，浑身是血的人，眉心禁不住的皱了皱。
en_us: After finishing his piece, he harrumphed and turned his head toward the immobilized person who was still covered in blood on the ground. He could not help but knit his brows together.

source: 说完它动了动头，把右眼移了过来。果然里面的眼珠只有上半截是红的，下半截还是黑的。
en_us: It turned its head to show Shen Ying its right eye. Indeed, while half of its eye was red, the other half was still black.

source: 说完掏出几块打开禁制的令牌，示意她们去前殿右侧的居所。
en_us: Finished, he took out a couple of tokens to remove the restrictions and signaled them to go to their lodgings at the right side of the front hall.

source: 说完放开神识，开始感应起魔修的气息来。
en_us: He released his divine perception and began to search for the fiendish cultivator's presence.

source: 说完柳长老就钻进了偏厅，江逸却傻眼了，他哪懂什么茯苓？什么是白矾啊？他又不敢多问，只能讪讪的走进了存放药草的房间内。
en_us: After instructing Jiang Yi, Elder Liu immediately went into the side room. Yet Jiang Yi stood dumbstruck. How could he possibly know what china root was? And what on earth was alum? However, he did not dare to ask further. He had no choice but to walk into the room where the ingredients were stored.

source: 说完江逸再次抬腿狠狠对着江如虎剩下的一条好腿踩下，又单腿猛然将他的身子重重的踹飞出去，目光才在众人身上扫过，沉喝道：“半个时辰之内，给江如虎治疗，否则他……必死无疑！你们所有人给小爷我记住，以后看到我必须绕道，谁敢再挑衅小爷，江如虎就是你们榜样。”
en_us: Finishing what he had to say, Jiang Yi raised his leg once again before viciously stepping down on Jiang Yi's remaining good leg. Suddenly, with one of his legs, he sent Jiang Ruhu's body heavily flying off with another kick. It was only then that he swept a gaze across the bodies of all his remaining opponents before deeply shouting, "Heal Jiang Ruhu within the next hour, otherwise he... would definitely die, no doubt about that! All of you better remember, if you ever see me, your Young Master, in the future, you must make a detour around me. Otherwise, should you dare to provoke me, your Young Master, the fate of Jiang Ruhu today would be happening to you."

source: 说完江逸就不顾这杨管事的挽留，径直朝武殿外走去，在门口那黑甲护卫诧异的目光中，朝城东的江家大院快步走去。
en_us: Finishing what he had to say and ignoring Manager Yang's attempt at making him stay, Jiang Yi directly walked out of the Martial Arts Hall. In the incredulous gaze of the guard wearing black armour, he walked in a quick pace towards the Jiang Residence Central Courtyard in the east of the city.

source: 说完江逸收起紫金，很没礼貌的一拱手匆忙朝外面走去。那鹤大师本还想多问几句，却被姬听雨一抬手拦住了下来。
en_us: Finishing what he had to say, Jiang Yi kept the purple gold, before impolitely cupping his hands to bid them farewell and hurriedly walked out of the Pavilion building. Master He initially wanted to asked more questions to him, but he was prevented from doing so with a raise of Ji Tingyu's hand.

source: 说完江逸身子就朝西山之下爆射而去，所有江家子弟摄于江逸的威势，竟无人敢拦截，反而很多人看着江逸的背影都露出畏惧之色。
en_us: Finishing his statemnet, Jiang Yi rushed off in a burst of quick speed, in the direction of the foot of the Western Hills. Having taken in the supreme might of Jiang Yi's power, out of all the Jiang Clan descendants surrounding him, none of them actually dared to stop him in his tracks. Conversely, many of them looked at the figure of Jiang Yi's back as he raced away, revealing a look of pure horror on their faces.

source: 说完目光一凝，全身仙气暴发，整个人气势一变，不对……是真的整个人都变了！块块肌肉暴出，个头瞬间拔高，整个身体肿涨了两倍。
en_us: Then, her gaze focused and the immortal Qi erupted from her body. Her mannerism changed. No. The entire person changed. Muscles popped up and her height suddenly increased, and her entire body became twice its original size.

source: 说完直接踩上羿清的飞剑，朝远处飞了过去。
en_us: As soon as the words were out of her mouth, Yi Qing hopped on to his flying sword. He flew into the horizon.

source: 说完示意羿清和沈萤离开，刚走了两步，前面的沈萤却一顿，“你干嘛？”
en_us: Having said that, Lonemoon motioned for Yi Qing and Shen Ying to leave. However, he had only walked a couple of steps when Shen Ying, who was in front, came to a halt. "What's the matter?" he asked.

source: 说完立马转头就看向后面的一众妹子们，眼睛顿时一亮，带点兴奋的对着站第二位的妹子道，“思羽姑娘，我们又见面了。”
en_us: After that was done, he immediately turned to look at the girls behind them. His eyes suddenly brightened and, turning to face the second disciple in the group, he said, "Miss Si Yu, we meet again."

source: 说完管事放下丹药走了出去，没过一会带着一名白发苍苍的老者走了进来，这老者穿着一身月白色的长袍，满脸的不耐烦神色。
en_us: Finishing what he had to say, the housekeeper put down the elixir and walked out of the booth. It was not long before he brought a white-haired old man into the booth. The elderly man was dressed in a moon-white long robe, with his face giving off a sense of much impatience.

source: 说完荣管事便长袖一拂，大步离去。江逸只能讪讪的摸了摸鼻子，回房洗漱了一番，几口喝掉锅里的肉粥，就急急朝西山走去。
en_us: Upon finishing, Chief Rong flicked his long sleeves disdainfully and strode away from the courtyard. All Jiang Yi could do was scratch his nose in embarrassment. He headed back home to quickly freshen up and gulp down in a couple of mouthfuls of the meat porridge in the pot, before hastily making his way to the Western Hills.

source: 说完跳上台，想让场上的人停手，刚一走近，已经化身金钢芭比的思羽猛的回头一瞪，双眼仍是赤红，浑身的杀气开始无差别攻击，丝毫没有停手的意思。
en_us: After that, the judge jumped onto the stage trying to stop the Si Yu. As he drew nearer, the transformed iron barbie, Si Yu, turned back to glare at him. Those eyes of hers were bloody red, emitting a murderous intent as she continued her attack with no signs of stopping.

source: 说完转身走回了院子，觉得有点扎心，她有这么可怕吗？
en_us: She turned around and walked back to the yard feeling a prick in her heart — was she really that scary?

source: 说完转身进屋，嘭的一下关上了门。
en_us: She turned around and went into the house, slamming the door shut.

source: 说完还看向旁边一脸傲娇的萝卜，轩辕禹也看了过去，连着其它人也下意识的看向了萝卜。
en_us: Lonemoon looked pointedly at the radish next to him who had a cocky expression on its face. Xuan Yuanyu followed his gaze subconsciously.

source: 说完还眼泪汪汪，一脸控诉的看向沈萤，“小姐姐，说好我才是你唯一的花花呢？你要花，我也会开的啊！”
en_us: Its eyes began to fill with tears as it started to complain to Shen Ying, ”Little Big Sister, you said I would be your only plant. If you want flowers, I can give you some!"

source: 说完这才慢悠悠的从虎尸身上爬了下来，摸了摸扁了的肚皮，感觉有点饿，环视了一圈满地各色种族的妖尸，既然都出来了，不如……吃个夜宵？
en_us: With that said, she slowly got off the tiger carcass and rubbed her flat stomach. She was feeling a little hungry. She surveyed the demon carcasses of all shapes and sizes around her. Since she had come here, she might as well… have supper?

source: 说完随着另外两人，一起跳入了那面如水镜一般的入口里。
en_us: Just as the words were out of his mouth, he stepped into the crystallic-looking entrance with his other two companions..

source: 说完，两人一脸兴奋的出了后殿……
en_us: With that said, the two of them exited the hall excitedly...

source: 说完，两人嗖的一下就消失了？
en_us: The two of them disappeared immediately.

source: 说完，也顾不得多解释，直接转身快步走了进去，沈萤也跟了进去。
en_us: When he finished speaking, he turned to enter the shed. Shen Ying followed suit.

source: 说完，他再次看向其它三人道，“易家主，可有能困住游仙的法器？”
en_us: After giving his instructions to Lonemoon, he looked again at the other three men and asked, "Patriarch Yi, can you think of a way to delay the traveling immortals?"

source: 说完，他剑一扬，四周的剑光大盛，万千剑气朝着阵内杀去。
en_us: As he finished, he raised his sword, and as the sword's brilliance consumed the surroundings, tons of Sword Qi was directed towards the array.

source: 说完，他直接唤出武器，似是想结印做法，毕浩却突然大声阻止，“住手！”
en_us: He summoned his weapon at the end of his words, seemingly about to form a hand seal and cast a Dharma spell, but Bi Hao suddenly shouted loudly, "Stop it!"

source: 说完，他直接飞身而起，举剑就朝着她刺了过去，一时间庞大的剑气带起一阵巨大的狂风，所行之地草木翻飞，灵气逼人。他速度极快，身形一闪已经到了沈萤面前，眼看着那柄长剑就要没入对方的脑口。
en_us: As soon as he had finished, he flew up, drew his sword, and headed straight for Shen Ying. His surging Sword Qi whipped up a huge gust of wind. The branches and leaves on the ground flew up as the Spirit Qi in the air suddenly became dense. He was really quick; in a second, he was right in front of Shen Ying. His sword was centimetres away from Shen Ying's head.

source: 说完，他眼神一冷，似是耐心用尽，一挥手顿时身后两个化神修士冲出，满天火海朝两人烧了过来。
en_us: On saying this, his eyes turned cold, and he seemed to have exhausted hs store of patience. With a wave of his hands, two Soul Formation cultivators, their bodies ablaze in flames, rushed out and surrounded the two girls.

source: 说完，他认真咚咚咚的朝着她嗑了三个头，一脸紧张期待的看着她。
en_us: He then conscientiously gave her three loud kowtows with a face of eagerness.

source: 说完，作势就要掀开身下的长袍。
en_us: It looked as though it wanted to tear open its robes as soon as it finished speaking.

source: 说完，十几个化神修士，顿时蜂拥而上，各式的术法铺天盖地而来。
en_us: As soon as he finished speaking, ten of the Soul Formation cultivators floated into the sky. All kinds of sorcery shot toward the ground.

source: 说完，又回头看向孤月，“你过半个时辰后，再将另外四个人引过来即可。”
en_us: Turning to Lonemoon he said, "After an hour, divert another four over here."

source: 说完，她再次转身走了，又十分钟后……
en_us: After that, she turned and walked away again. Ten minutes later...

source: 说完，干脆利落的往门口而去，刚要出门。
en_us: As soon as the words were out of her mouth, she headed for the exit.

source: 说完，放下筷子，转身一言不发的就出了后殿。
en_us: He put down his chopsticks and turned to leave without saying another word.

source: 说完，更盛数倍的威压，带着杀气，直朝着对方而去。
en_us: After he finished speaking, he increased the air pressure, fully intending to kill. The suppressive force flew toward Yi Qing.

source: 说完，江恨水径直走进丹房取了几大瓶丹药就离开了炼丹房，走出丹房后再也没有看江逸一眼，更别说道别了，宛如两个陌路人。
en_us: Finishing his sentence, Jiang Yi walked directly into the elixir room, retrieved several big bottles of elixirs and left the alchemy lab. As he left the alchemy lab, he did not look back and give Jiang Yi a glance, to say nothing of sending him a farewell. It was as though they were two strangers to each other.

source: 说完，江逸目光陡然扫向江豹，身子也闪电般朝江豹冲去，身上杀气十足，双腿和衣袍之上都有江松的鲜血，看起来如一尊杀神般恐怖。
en_us: Finishing his declaration, Jiang Yi's sights suddenly turned to look at Jiang Bao; like a lightning, he rushed at Jiang Bao. He looked just like a horrifying killer god that was bursting with killing intent, both his legs and robes were drenched with Jiang Song's blood.

source: 说完，直接起身往前走去，开始一手一截，一手一截的把满地的海鲜，往袋里扔，大丰收啊！
en_us: She walked toward the seafood and grabbed handfuls of meat, chucking them into the storage bag. What a catch!

source: 说完，直接转头看向沈萤道，“沈萤，我跟羿清去一趟追魂楼，马上就回来。”
en_us: As soon as he finished speaking, he turned to Shen Ying and said, "Shen Ying, Yi Qing and I will make a trip to Soul Chasing Tower. We'll be right back."

source: 说完，继续泪汪汪的看向沈萤，“嘤嘤……萝卜需要小姐姐抱抱才能起来。”
en_us: It turned back to Shen Ying and continued to cry, "Wa... wa... Radish needs Little Missy to carry it up before it can stand."

source: 说完，转身拉着牛爸爸走入了传送阵。
en_us: With that, she pulled Father Niu with her into the transportation array.

source: 说完，追着羿清的方向飞了过去。
en_us: So saying, he flew off in pursuit of Yi Qing.

source: 说实话发现这个问题后，她是想找别人确认确认的，听说这个世界还真的有仙人，可惜她一个月实在见不着几个人。只能在这里住下来，她性子一向安逸，说好听点是随遇而安，难听点就是不知上进的死宅懒。人生还真没啥追求。
en_us: To be completely honest, after discovering this problem, she wanted to find someone to acknowledge that there were indeed deities in this world, but to her dismay she barely met more than a handful of people in a month. Her character had always been happy-go-lucky: to put it nicely would be that she was adaptable to her circumstances, but to put it bluntly would be that she did not strive for progress and was a totally lazy shut-in. Her life was truly lacking of any pursuits.

source: 说实话，由于男主宁子安，他是不想过多跟薄家扯上关系的。上次魔界之门是个意外，毕竟事关整个仙界。
en_us: To be honest, because of the owner Ning ZiAn, he did not wish to have anymore relations with the Pu Family. The door of Demon Realm the previous time was just an accident. Moreover, it concerned the entire Immortal Realm.

source: 说干就干。
en_us: If Jiang Yi said he'd do it, he would definitely do it!

source: 说干就干！
en_us: That was how Jiang Yi was: if he said he would do it, he would definitely do it!

source: 说时迟，那时快！
en_us: In the blink of an eye!

source: 说是九九雷劫，却是八十二道，牛爸爸的直接变成了八十三道，很明显就是不想让人成仙。
en_us: It was called the Nine Nine Lightning Tribulation, yet there were 82 bolts of lightning - 83 for Father Niu. It was obvious he was trying to stop people from ascending into immortality.

source: 说着他一挥手，果然十几只兔子同时立了起来，整个兔身发生了变化，不到半会已经化出了人形，只是……顶着个兔头。
en_us: Upon saying those words, sure enough, about ten or so rabbits stood up simultaneously as their rabbit bodies transformed. Within a moment they had manifested human forms, but… with rabbit heads.

source: 说着他向前两步，开始展示起剑法来。一招一式都极为凌厉，大片的剑光瞬间笼罩住了整个岛，掀起大片的沙石在空中飞舞。他的身影更是直接消失在了剑光之中，仿佛已经溶入了剑法之中。
en_us: As he said this, he took a couple of steps forward and started to showcase his swordsmanship. Every sword move was very sharp, the brilliant gleams of the sword enveloping the whole island, causing the large patches of sand and stones on the ground to be blasted away. His figure disappeared within the sword gleams, as if merged with the sword dharma.

source: 说着他手间一转，手里的法器带着凌厉的杀气，就朝着郁红飞了过去。
en_us: As he said this, he flipped his hand and a Dharma artifact enveloped in a dense murderous aura flew towards Yu Hong.

source: 说着他接过那团黑气，扬手布下一个阵法，口中念了大段的咒法，不到一会他周身就出现了道道金色光芒，无数法符快速飞入那团黑气里。
en_us: He received the lump of black matter as he spoke and set up a matrix. He chanted a long spell and rays of golden lights shimmered around him not long after. Countless talismans quickly flew towards the lump of black matter.

source: 说着他直接强行调动灵气，结印布阵，手里阵法出现的一瞬间，体内的妖气再次反噬筯脉，张口噗的一声，喷出大口血，把本就沾了血迹的衣服，染得更红了。
en_us: He immediately forced his Spirit Qi to activate, directing it to imprint the layout of an array. The moment the array formation appeared in his hand, the demonic aura in his body once again engulfed and attacked his meridians. He opened his mouth and blood spurted out in a gush. His clothes, already covered in blood stains, was dyed into an even deeper shade of red.

source: 说着她直接把参赛令牌递了过去。
en_us: He handed over the participation token to her as he spoke.

source: 说着她突然手心一紧。
en_us: As soon as the words were out of her mouth, she clenched the fist that held onto the Traveling Immortal's fist..

source: 说着它朝着后面的众兔一挥爪，十几只高阶兔妖立马一字排开，规规矩矩的坐成一排，连尾巴都没有乱动一下，别说是攻击了。
en_us: As it spoke, it turned towards the colony of rabbits behind it. With a wave of its paw, around ten of the highly powerful rabbit demons fell into a straight line in a snap. They sat in an orderly row and did not so much as wag their tails, not to mention attack.

source: 说着就想去抓她的手。这么多年，她是唯一一个让他送出玄灵花的女子。
en_us: He graspd her hand suddenly. She was the only girl who made him want to give the Black Spirit Blossom to her after all these years.

source: 说着手里的旗子一扬，顿时数十道闪电发出，嗞啦啦的劈向院中，不单将那人再次劈得瘫了回去，周围更是劈出了好几个大坑。
en_us: The gonfalon was raised along with those words. Right at that moment, dozens of lightning bolts shot out towards the yard. Not only was the man struck by those lightning bolts till he was limp, several gaping craters were made in the surrounding as well.

source: 说着江逸匆忙的朝怀中掏去，满脸都是哀求之色，管事和马公子还有那几名护卫眼眸一亮，下意识朝江逸掏钱的左手望去。
en_us: As he was speaking, Jiang Yi hurriedly reached into his chest pocket with a pleading look. The eyes of the housekeeper, Young Master Ma, and those guards, lit up. They subconsciously directed their gaze to Jiang Yi's left hand that was in the midst of retrieving the money.

source: 说着直接上前一步，想接过他手里的盘子，对方却不松，拉了几次都没拉过来，一时间僵持了下来。
en_us: Yi Qing stepped forward and took the plate from Bai Ze's hands, but Bai Ze refused to let go of the plate. Yi Qing kept trying to pull the plate over, but to no avail.
